Repository: jeremycalles/Portfolio
Catalog: Shared/Resources/*.lproj/Localizable.strings
Languages: fr

# app.tagline
source: Stock, OPCVM & Gold Tracker
fr: Suivi actions, OPCVM & Or

# general.comparisonPeriod
source: Comparison Period
fr: Période de comparaison

# general.cancel
source: Cancel
fr: Annuler

# general.save
source: Save
fr: Enregistrer

# general.delete
source: Delete
fr: Supprimer

# general.edit
source: Edit
fr: Modifier

# general.add
source: Add
fr: Ajouter

# general.done
source: Done
fr: Terminé

# general.error
source: Error
fr: Erreur

# general.loading
source: Loading...
fr: Chargement...

# general.noData
source: No data
fr: Aucune donnée

# general.overview
source: Overview
fr: Aperçu

# general.manage
source: Manage
fr: Gérer

# general.data
source: Data
fr: Données

# general.subtotal
source: Subtotal
fr: Sous-total

# general.grandTotal
source: Grand Total
fr: Total général

# general.na
source: N/A
fr: N/D

# nav.dashboard
source: Dashboard
fr: Tableau de bord

# nav.accounts
source: Accounts
fr: Comptes

# nav.settings
source: Settings
fr: Paramètres

# nav.quadrantReport
source: Quadrant Report
fr: Rapport par quadrant

# nav.allHoldings
source: All Holdings
fr: Toutes les positions

# nav.bankAccounts
source: Bank Accounts
fr: Comptes bancaires

# nav.holdings
source: Holdings
fr: Positions

# nav.priceHistory
source: Price History
fr: Historique des prix

# nav.priceGraph
source: Price Graph
fr: Graphique des prix

# dashboard.portfolioSummary
source: Portfolio Summary
fr: Résumé du portefeuille

# dashboard.portfolioTrend
source: Portfolio Trend
fr: Tendance du portefeuille

# dashboard.portfolioValue
source: Portfolio Value
fr: Valeur du portefeuille

# dashboard.portfolioValueGold
source: Portfolio Value (Gold)
fr: Valeur du portefeuille (Or)

# dashboard.quadrantAllocation
source: Quadrant Allocation
fr: Répartition par quadrant

# dashboard.accountAllocation
source: Account Allocation
fr: Répartition par compte

# dashboard.noHoldings
source: No holdings to display
fr: Aucune position à afficher

# dashboard.noHistoricalData
source: No historical data available
fr: Aucun historique disponible

# dashboard.comparisonPeriod
source: Comparison Period:
fr: Période de comparaison :

# dashboard.viewMode
source: View:
fr: Vue :

# dashboard.holdings
source: Holdings
fr: Positions

# dashboard.accounts
source: Accounts
fr: Comptes

# dashboard.totalPortfolioValue
source: Total Portfolio Value
fr: Valeur totale du portefeuille

# dashboard.noAccountsWithData
source: No accounts with data
fr: Aucun compte avec données

# dashboard.noDataAvailable
source: No data available
fr: Aucune donnée disponible

# summary.gold
source: Gold
fr: Or

# summary.from
source: from
fr: depuis

# summary.lastUpdate
source: Updated
fr: Mis à jour

# period.1day
source: 1 Day
fr: 1 Jour

# period.1week
source: 1 Week
fr: 1 Semaine

# period.1month
source: 1 Month
fr: 1 Mois

# period.3months
source: 3 Months
fr: 3 Mois

# period.6months
source: 6 Months
fr: 6 Mois

# period.1year
source: 1 Year
fr: 1 An

# period.2years
source: 2 Years
fr: 2 Ans

# period.5years
source: 5 Years
fr: 5 Ans

# period.all
source: All
fr: Tout

# period.yearToDate
source: 1 January
fr: 1er Janvier

# instruments.addInstrument
source: Add Instrument
fr: Ajouter un instrument

# instruments.editInstrument
source: Edit Instrument
fr: Modifier l'instrument

# instruments.name
source: Name
fr: Nom

# instruments.currency
source: Currency
fr: Devise

# instruments.unassigned
source: Unassigned
fr: Non assigné

# instruments.isinHint
source: Enter an ISIN, ticker symbol, or special identifier (e.g., VERACASH:GOLD_SPOT)
fr: Entrez un ISIN, symbole ticker ou identifiant spécial (ex: VERACASH:GOLD_SPOT)

# instruments.removeFromQuadrant
source: Remove from Quadrant
fr: Retirer du quadrant

# instruments.assignToQuadrant
source: Assign to Quadrant
fr: Assigner au quadrant

# instruments.deleteInstrument
source: Delete Instrument
fr: Supprimer l'instrument

# instruments.noQuadrantsAvailable
source: No quadrants available
fr: Aucun quadrant disponible

# accounts.title
source: Accounts
fr: Comptes

# accounts.addAccount
source: Add Account
fr: Ajouter un compte

# accounts.editAccount
source: Edit Account
fr: Modifier le compte

# accounts.bankName
source: Bank Name
fr: Nom de la banque

# accounts.accountName
source: Account Name
fr: Nom du compte

# accounts.holdings
source: Holdings
fr: Positions

# accounts.noAccounts
source: No accounts
fr: Aucun compte

# accounts.otherAccounts
source: Other Accounts
fr: Autres comptes

# accounts.noBankAccounts
source: No bank accounts configured
fr: Aucun compte bancaire configuré

# accounts.addBankAccountFirst
source: Add a bank account first to start tracking holdings
fr: Ajoutez un compte bancaire pour commencer à suivre vos positions

# accounts.selectAccount
source: Select Account
fr: Sélectionner un compte

# accounts.selectAnAccount
source: Select an account
fr: Sélectionnez un compte

# accounts.holdingsCount
source: %d holdings
fr: %d positions

# accounts.bankAccountsCount
source: Bank Accounts (%d)
fr: Comptes bancaires (%d)

# accounts.holdingsCountTitle
source: Holdings (%d)
fr: Positions (%d)

# accounts.noHoldingsInAccount
source: No holdings in this account
fr: Aucune position dans ce compte

# accounts.noHoldingsYet
source: No holdings yet
fr: Aucune position

# accounts.tapToAddHolding
source: Tap + to add your first holding
fr: Appuyez sur + pour ajouter votre première position

# accounts.acrossAllAccounts
source: across all accounts
fr: sur tous les comptes

# holdings.addHolding
source: Add Holding
fr: Ajouter une position

# holdings.selectInstrument
source: Select Instrument
fr: Sélectionner un instrument

# holdings.selectAnInstrument
source: Select an instrument to view price history
fr: Sélectionnez un instrument pour voir l'historique des prix

# holdings.selectAnInstrumentGraph
source: Select an instrument to view price graph
fr: Sélectionnez un instrument pour voir le graphique

# holdings.quantity
source: Quantity
fr: Quantité

# holdings.quantityUnits
source: %@ units
fr: %@ unités

# holdings.purchaseDetails
source: Purchase Details
fr: Détails d'achat

# holdings.purchaseDetailsHint
source: Optional: Track your cost basis for performance calculation
fr: Optionnel : Suivez votre prix de revient pour le calcul de performance

# holdings.value
source: Value
fr: Valeur

# holdings.change
source: Change
fr: Variation

# holdings.qty
source: Qty
fr: Qté

# holdings.noHoldings
source: No holdings
fr: Aucune position

# holdings.noChartData
source: No chart data
fr: Aucune donnée graphique

# quadrants.addQuadrant
source: Add Quadrant
fr: Ajouter un quadrant

# quadrants.quadrantDetails
source: Quadrant Details
fr: Détails du quadrant

# quadrants.quadrantDetailsHint
source: Examples: 'Growth Stocks', 'Bonds', 'Real Estate', 'Gold'
fr: Exemples : 'Actions de croissance', 'Obligations', 'Immobilier', 'Or'

# quadrants.quadrantAssignment
source: Quadrant Assignment
fr: Assignation au quadrant

# quadrants.quadrantAssignmentHint
source: Quadrants help organize your portfolio into categories for reporting
fr: Les quadrants aident à organiser votre portefeuille en catégories pour les rapports

# quadrants.categorizeHint
source: Quadrants categorize instruments for portfolio analysis. Assign via Instruments tab.
fr: Les quadrants catégorisent les instruments pour l'analyse du portefeuille. Assignez via l'onglet Instruments.

# reports.quadrantReport
source: Quadrant Report
fr: Rapport par quadrant

# reports.comparisonPeriod
source: Comparison Period:
fr: Période de comparaison :

# reports.noHoldingsToDisplay
source: No holdings to display
fr: Aucune position à afficher

# reports.addInstrumentsHint
source: Add instruments and holdings to see your quadrant report
fr: Ajoutez des instruments et des positions pour voir votre rapport par quadrant

# reports.asOf
source: as of %@
fr: au %@

# reports.noPriceHistoryAvailable
source: No price history available
fr: Aucun historique de prix disponible

# reports.clickToAddPrice
source: Click + to add a price
fr: Cliquez sur + pour ajouter un prix

# reports.noPriceDataForPeriod
source: No price data for this period
fr: Aucune donnée de prix pour cette période

# reports.deleteConfirmation
source: Are you sure you want to delete the price for %@?
fr: Voulez-vous vraiment supprimer le prix du %@ ?

# stats.bestPerformer
source: Best Performer
fr: Meilleure performance

# stats.worstPerformer
source: Worst Performer
fr: Pire performance

# stats.largestPosition
source: Largest Position
fr: Plus grande position

# stats.totalHoldings
source: Total Holdings
fr: Total des positions

# stats.moreItems
source: +%d more
fr: +%d autres

# settings.demoMode
source: Demo Mode
fr: Mode Démo

# settings.demoModeDescription
source: Anonymize portfolio values with randomized quantities for presentations
fr: Anonymiser les valeurs du portefeuille avec des quantités aléatoires pour les présentations

# settings.demoModeEnable
source: Enable Demo Mode
fr: Activer le mode démo

# settings.demoModeActive
source: Demo mode active - values are randomized
fr: Mode démo actif - les valeurs sont aléatoires

# settings.demoModeRandomize
source: Randomize
fr: Aléatoire

# settings.title
source: Settings
fr: Paramètres

# settings.language
source: Language
fr: Langue

# settings.languageDescription
source: Select the app language
fr: Sélectionnez la langue de l'application

# settings.english
source: English
fr: Anglais

# settings.french
source: French
fr: Français

# settings.dataManagement
source: Data Management
fr: Gestion des données

# settings.updatePrices
source: Update Prices
fr: Mettre à jour les prix

# settings.backfillData
source: Backfill Historical Data
fr: Récupérer l'historique

# settings.about
source: About
fr: À propos

# settings.general
source: General
fr: Général

# settings.database
source: Database
fr: Base de données

# settings.background
source: Background
fr: Arrière-plan

# settings.storage
source: Storage
fr: Stockage

# settings.storageDescription
source: iCloud storage syncs your database across all your Apple devices.
fr: Le stockage iCloud synchronise votre base de données sur tous vos appareils Apple.

# settings.importExportHint
source: Use Import/Export to manually transfer your database between devices.
fr: Utilisez Import/Export pour transférer manuellement votre base de données entre appareils.

# settings.localStorage
source: Local Storage
fr: Stockage local

# settings.localStorageOnly
source: Local storage only
fr: Stockage local uniquement

# settings.syncingWithICloud
source: Syncing with iCloud
fr: Synchronisation avec iCloud

# settings.iCloudRequirement
source: iCloud sync requires Apple Developer Program ($99/year)
fr: La synchronisation iCloud nécessite l'Apple Developer Program (99$/an)

# settings.importDatabase
source: Import Database from File
fr: Importer la base de données

# settings.exportDatabase
source: Export Database
fr: Exporter la base de données

# settings.openInFinder
source: Open in Finder
fr: Ouvrir dans le Finder

# settings.moveData
source: Move Data
fr: Déplacer les données

# settings.startFresh
source: Start Fresh
fr: Recommencer à zéro

# settings.moveDataConfirmation
source: Would you like to move your existing data to %@, or start with a fresh database?
fr: Voulez-vous déplacer vos données existantes vers %@, ou recommencer avec une base de données vierge ?

# settings.privacyMode
source: Privacy Mode
fr: Mode privé

# settings.backgroundRefresh
source: Background Refresh
fr: Actualisation en arrière-plan

# settings.backgroundRefreshInterval
source: Every 3 hours
fr: Toutes les 3 heures

# settings.lastRefresh
source: Last refresh
fr: Dernière actualisation

# settings.backgroundUpdates
source: Background Updates
fr: Mises à jour en arrière-plan

# settings.backgroundUpdatesDescription
source: Prices are automatically updated in the background when the app is not in use. Long-press to view logs.
fr: Les prix sont automatiquement mis à jour en arrière-plan lorsque l'app n'est pas utilisée. Appui long pour voir les logs.

# settings.automaticUpdates
source: Automatic Updates
fr: Mises à jour automatiques

# settings.automaticUpdatesDescription
source: Refresh prices every 3 hours, even when the app is closed
fr: Actualiser les prix toutes les 3 heures, même lorsque l'app est fermée

# settings.statusActive
source: Active
fr: Actif

# settings.statusInstalledNotRunning
source: Installed but not running
fr: Installé mais non actif

# settings.statusNotInstalled
source: Not installed
fr: Non installé

# settings.enable
source: Enable
fr: Activer

# settings.disable
source: Disable
fr: Désactiver

# settings.runNow
source: Run Now
fr: Exécuter maintenant

# settings.refreshStatus
source: Refresh Status
fr: Actualiser le statut

# settings.recentActivity
source: Recent Activity
fr: Activité récente

# settings.openLogsFolder
source: Open Logs Folder
fr: Ouvrir le dossier des logs

# settings.noLogsAvailable
source: No logs available
fr: Aucun log disponible

# settings.logsDescription
source: Logs will appear here after the first background refresh occurs.
fr: Les logs apparaîtront ici après la première actualisation en arrière-plan.

# settings.backgroundRefreshLogs
source: Background Refresh Logs
fr: Logs d'actualisation

# settings.accountDetails
source: Account Details
fr: Détails du compte

# settings.accountDetailsHint
source: Example: Bank = 'Degiro', Account = 'CTO' or 'PEA'
fr: Exemple : Banque = 'Degiro', Compte = 'CTO' ou 'PEA'

# settings.updatePricesDescription
source: Update prices and backfill historical data
fr: Mettre à jour les prix et récupérer l'historique

# action.updatePrices
source: Update Prices
fr: Mettre à jour les prix

# action.updateAllPrices
source: Update All Prices
fr: Mettre à jour tous les prix

# action.backfill1Year
source: Backfill 1 Year (Monthly)
fr: Historique 1 an (mensuel)

# action.backfill2Years
source: Backfill 2 Years (Monthly)
fr: Historique 2 ans (mensuel)

# action.backfill5Years
source: Backfill 5 Years (Monthly)
fr: Historique 5 ans (mensuel)

# action.backfill1Month
source: Backfill 1 Month (Daily)
fr: Historique 1 mois (quotidien)

# action.backfillHistorical1Year
source: Backfill Historical (1 Year)
fr: Historique (1 an)

# action.backfillHistorical2Years
source: Backfill Historical (2 Years)
fr: Historique (2 ans)

# action.backfillHistorical5Years
source: Backfill Historical (5 Years)
fr: Historique (5 ans)

# action.addPrice
source: Add Price
fr: Ajouter un prix

# action.editPrice
source: Edit Price
fr: Modifier le prix

# chart.noGoldPriceData
source: No gold price data
fr: Aucune donnée de prix de l'or

# chart.dataPoints
source: %d data points
fr: %d points de données

# chart.clickToToggle
source: Click to toggle between EUR and Gold ounces
fr: Cliquez pour basculer entre EUR et Onces d'or

# chart.noPriceHistory
source: No price history
fr: Aucun historique de prix

# chart.portfolioLabel
source: Portfolio
fr: Portefeuille

# chart.goldComparison
source: Gold
fr: Or

# tooltip.updateAllPrices
source: Update all prices
fr: Mettre à jour tous les prix

# tooltip.backfillHistoricalData
source: Backfill historical data
fr: Récupérer l'historique

# tooltip.addPrice
source: Add Price
fr: Ajouter un prix

# tooltip.edit
source: Edit
fr: Modifier

# tooltip.delete
source: Delete
fr: Supprimer

# refresh.success
source: Prices Updated
fr: Prix mis à jour

# refresh.partial
source: Partial Update
fr: Mise à jour partielle

source: Refresh Failed
fr: Échec de l'actualisation

# refresh.successDetail
source: All %d instruments updated successfully
fr: Les %d instruments ont été mis à jour

# refresh.resultDetail
source: %d of %d instruments updated
fr: %d sur %d instruments mis à jour

# refresh.failedInstruments
source: Failed instruments:
fr: Instruments en échec :

# refresh.debugReasons
source: Why each failed (debug):
fr: Raison par instrument (debug) :

# error.fetchFailed
source: Failed to fetch data
fr: Échec de la récupération des données

# error.saveFailed
source: Failed to save
fr: Échec de l'enregistrement

# error.deleteFailed
source: Failed to delete
fr: Échec de la suppression
